Canonical-Flows/jet/case8/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 7.7958;

boundaryField
{
    inlet1
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    .014;
        value           uniform 83.3565;
    }
	
	inlet2
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    .014;
        value           $internalField;
    }
	
    outlet
    {
        type            zeroGradient;
    }
	
	wall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
